Repository: HosamGirgis55/Academix
Catalog: Academix.WebAPI/Resources/LocalizationService.*.resx
Languages: ar

# Operation_Success
source: Operation completed successfully
ar: تمت العملية بنجاح

# Resource_Created
source: Resource created successfully
ar: تم إنشاء المورد بنجاح

# Resource_Updated
source: Resource updated successfully
ar: تم تحديث المورد بنجاح

source: Resource not found
ar: المورد غير موجود

source: Invalid request
ar: طلب غير صحيح

source: Unauthorized access
ar: وصول غير مصرح به

source: Access forbidden
ar: الوصول محظور

# Server_Error
source: Internal server error
ar: خطأ داخلي في الخادم

source: Validation failed
ar: فشل التحقق من الصحة

# StudentCreated
source: Student created successfully
ar: تم إنشاء الطالب بنجاح

# StudentUpdated
source: Student updated successfully
ar: تم تحديث الطالب بنجاح

# StudentDeleted
source: Student deleted successfully
ar: تم حذف الطالب بنجاح

source: Student not found
ar: الطالب غير موجود

# StudentRetrieved
source: Student retrieved successfully
ar: تم استرداد الطالب بنجاح

# FileUploaded
source: File uploaded successfully
ar: تم رفع الملف بنجاح

source: File upload failed
ar: فشل رفع الملف

source: No file selected
ar: لم يتم اختيار ملف

# EmailAlreadyExists
source: A student with this email already exists
ar: يوجد طالب بهذا البريد الإلكتروني بالفعل

# FirstNameRequired
source: First name is required
ar: الاسم الأول مطلوب

# LastNameRequired
source: Last name is required
ar: اسم العائلة مطلوب

# EmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# EmailInvalid
source: Email must be a valid email address
ar: يجب أن يكون البريد الإلكتروني صحيحاً

# StudentNumberRequired
source: Student number is required
ar: رقم الطالب مطلوب

# StudentNumberInvalid
source: Student number must be exactly 8 digits
ar: يجب أن يكون رقم الطالب 8 أرقام بالضبط

# DateOfBirthRequired
source: Date of birth is required
ar: تاريخ الميلاد مطلوب

# AgeInvalid
source: Student must be between 16 and 100 years old
ar: يجب أن يكون عمر الطالب بين 16 و 100 سنة

source: First name is required
ar: الاسم الأول مطلوب

# FirstNameMinLength
source: First name must be at least 2 characters
ar: يجب أن يكون الاسم الأول على الأقل حرفين

# FirstNameMaxLength
source: First name cannot exceed 50 characters
ar: لا يمكن أن يتجاوز الاسم الأول 50 حرفاً

source: Last name is required
ar: اسم العائلة مطلوب

# LastNameMinLength
source: Last name must be at least 2 characters
ar: يجب أن يكون اسم العائلة على الأقل حرفين

# LastNameMaxLength
source: Last name cannot exceed 50 characters
ar: لا يمكن أن يتجاوز اسم العائلة 50 حرفاً

source: Email is required
ar: البريد الإلكتروني مطلوب

# InvalidEmailFormat
source: Email must be a valid email address
ar: يجب أن يكون البريد الإلكتروني صحيحاً

# EmailMaxLength
source: Email cannot exceed 100 characters
ar: لا يمكن أن يتجاوز البريد الإلكتروني 100 حرف

source: Password is required
ar: كلمة المرور مطلوبة

# PasswordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور على الأقل 6 أحرف

# PasswordComplexity
source: Password must contain at least one uppercase letter, one lowercase letter, one digit, and one special character
ar: يجب أن تحتوي كلمة المرور على حرف كبير وحرف صغير ورقم ورمز خاص واحد على الأقل

source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# InvalidGender
source: Please select a valid gender
ar: يرجى اختيار جنس صحيح

source: Country is required
ar: البلد مطلوب

# InvalidPhoneNumber
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# UserAlreadyExists
source: A user with this email already exists
ar: يوجد مستخدم بهذا البريد الإلكتروني بالفعل

# CountryNotFound
source: Selected country not found
ar: البلد المحدد غير موجود

source: User creation failed
ar: فشل إنشاء المستخدم

source: Student registered successfully
ar: تم تسجيل الطالب بنجاح

source: Registration failed
ar: فشل التسجيل

# CertificateNameRequired
source: Certificate name is required
ar: اسم الشهادة مطلوب

# CertificateNameMaxLength
source: Certificate name cannot exceed 200 characters
ar: لا يمكن أن يتجاوز اسم الشهادة 200 حرف

# CertificateUrlRequired
source: Certificate URL is required
ar: رابط الشهادة مطلوب

source: Invalid certificate URL
ar: يرجى إدخال رابط شهادة صحيح

# CertificateDescriptionMaxLength
source: Certificate description cannot exceed 500 characters
ar: لا يمكن أن يتجاوز وصف الشهادة 500 حرف

# Enum_Gender_Male
source: Male
ar: ذكر

# Enum_Gender_Female
source: Female
ar: أنثى

# CertificateIssuedByRequired
source: Certificate issuer is required
ar: جهة إصدار الشهادة مطلوبة

# CertificateIssuedByMaxLength
source: Certificate issuer cannot exceed 200 characters
ar: لا يمكن أن تتجاوز جهة إصدار الشهادة 200 حرف

# CertificateIssuedDateInvalid
source: Certificate issued date cannot be in the future
ar: لا يمكن أن يكون تاريخ إصدار الشهادة في المستقبل

# DegreeRequired
source: Degree is required
ar: الدرجة العلمية مطلوبة

# DegreeMaxLength
source: Degree cannot exceed 200 characters
ar: لا يمكن أن تتجاوز الدرجة العلمية 200 حرف

# InstitutionRequired
source: Institution name is required
ar: المؤسسة التعليمية مطلوبة

# InstitutionMaxLength
source: Institution cannot exceed 200 characters
ar: لا يمكن أن تتجاوز المؤسسة التعليمية 200 حرف

# FieldOfStudyRequired
source: Field of study is required
ar: مجال الدراسة مطلوب

# FieldOfStudyMaxLength
source: Field of study cannot exceed 200 characters
ar: لا يمكن أن يتجاوز مجال الدراسة 200 حرف

# StartDateInvalid
source: Start date cannot be in the future
ar: لا يمكن أن يكون تاريخ البداية في المستقبل

source: End date must be after start date
ar: يجب أن يكون تاريخ النهاية بعد تاريخ البداية

# SkillsRequired
source: Skills are required
ar: المهارات مطلوبة

# SkillIdRequired
source: Skill ID is required
ar: معرف المهارة مطلوب

# SkillLevelRange
source: Skill level must be between 1 and 5
ar: يجب أن يكون مستوى المهارة بين 1 و 5

# BirthDateMustBeInPast
source: Birth date must be in the past
ar: يجب أن يكون تاريخ الميلاد في الماضي

# MinimumAgeRequired
source: You must be at least 13 years old to register
ar: يجب أن تكون عمرك 13 سنة على الأقل للتسجيل

source: Failed to update device token
ar: فشل في تحديث رمز الجهاز

# SpecializationArAlreadyExists
source: Arabic specialization name already exists
ar: اسم التخصص العربي موجود بالفعل

# SpecializationEnAlreadyExists
source: English specialization name already exists
ar: اسم التخصص الإنجليزي موجود بالفعل

source: Specialization created successfully
ar: تم إنشاء التخصص بنجاح

# SpecializationCreateFailed
source: Failed to create specialization
ar: فشل في إنشاء التخصص

source: Specialization not found
ar: التخصص غير موجود

source: Specialization updated successfully
ar: تم تحديث التخصص بنجاح

# SpecializationUpdateFailed
source: Failed to update specialization
ar: فشل في تحديث التخصص

# SpecializationHasStudentsCannotDelete
source: Cannot delete specialization because it has students
ar: لا يمكن حذف التخصص لأنه يحتوي على طلاب

source: Specialization deleted successfully
ar: تم حذف التخصص بنجاح

# SpecializationDeleteFailed
source: Failed to delete specialization
ar: فشل في حذف التخصص

source: No specializations found
ar: لم يتم العثور على تخصصات

source: Specializations retrieved successfully
ar: تم استرداد التخصصات بنجاح

# SpecializationsRetrieveFailed
source: Failed to retrieve specializations
ar: فشل في استرداد التخصصات

source: Specialization retrieved successfully
ar: تم استرداد التخصص بنجاح

# SpecializationRetrieveFailed
source: Failed to retrieve specialization
ar: فشل في استرداد التخصص

# SpecializationIdRequired
source: Specialization ID is required
ar: معرف التخصص مطلوب

# SpecializationNameArRequired
source: Arabic specialization name is required
ar: اسم التخصص العربي مطلوب

# SpecializationNameArMinLength
source: Arabic specialization name must be at least 2 characters
ar: يجب أن يكون اسم التخصص العربي على الأقل حرفين

# SpecializationNameArMaxLength
source: Arabic specialization name cannot exceed 100 characters
ar: لا يمكن أن يتجاوز اسم التخصص العربي 100 حرف

# SpecializationNameEnRequired
source: English specialization name is required
ar: اسم التخصص الإنجليزي مطلوب

# SpecializationNameEnMinLength
source: English specialization name must be at least 2 characters
ar: يجب أن يكون اسم التخصص الإنجليزي على الأقل حرفين

# SpecializationNameEnMaxLength
source: English specialization name cannot exceed 100 characters
ar: لا يمكن أن يتجاوز اسم التخصص الإنجليزي 100 حرف

source: Teacher profile updated successfully
ar: تم تحديث ملف المدرس بنجاح

# TeacherUpdateFailed
source: Failed to update teacher profile
ar: فشل في تحديث ملف المدرس

source: Teacher not found
ar: المدرس غير موجود

# InvalidCountry
source: Invalid country selected
ar: البلد المحدد غير صالح

# UserIdRequired
source: User ID is required
ar: معرف المستخدم مطلوب

# BioMaxLength
source: Bio cannot exceed 1000 characters
ar: لا يمكن أن تتجاوز السيرة الذاتية 1000 حرف

# SalaryMustBePositive
source: Salary must be greater than or equal to 0
ar: يجب أن يكون الراتب أكبر من أو يساوي 0

# SalaryMaxValue
source: Salary cannot exceed 10000
ar: لا يمكن أن يتجاوز الراتب 10000

source: Invalid profile picture URL
ar: رابط الصورة الشخصية غير صالح

# TooManyAdditionalInterests
source: Cannot have more than 10 additional interests
ar: لا يمكن أن تكون لديك أكثر من 10 اهتمامات إضافية

# EmptyAdditionalInterest
source: Additional interest cannot be empty
ar: الاهتمام الإضافي لا يمكن أن يكون فارغاً

# AdditionalInterestLength
source: Additional interest must be between 1 and 100 characters
ar: يجب أن يكون الاهتمام الإضافي بين 1 و 100 حرف

# TooManyEducations
source: Cannot have more than 10 education entries
ar: لا يمكن أن تكون لديك أكثر من 10 مدخلات تعليمية

# InstitutionLength
source: Institution name must be between 2 and 200 characters
ar: يجب أن يكون اسم المؤسسة بين 2 و 200 حرف

# DegreeLength
source: Degree must be between 2 and 100 characters
ar: يجب أن تكون الدرجة العلمية بين 2 و 100 حرف

# FieldRequired
source: Field of study is required
ar: مجال الدراسة مطلوب

# FieldLength
source: Field must be between 2 and 100 characters
ar: يجب أن يكون المجال بين 2 و 100 حرف

# StartDateRequired
source: Start date is required
ar: تاريخ البداية مطلوب

# StartDateInFuture
source: Start date cannot be in the future
ar: لا يمكن أن يكون تاريخ البداية في المستقبل

# EndDateAfterStartDate
source: End date must be after start date
ar: يجب أن يكون تاريخ النهاية بعد تاريخ البداية

# DescriptionMaxLength
source: Description cannot exceed 500 characters
ar: لا يمكن أن يتجاوز الوصف 500 حرف

# TooManyCertificates
source: Cannot have more than 20 certificates
ar: لا يمكن أن تكون لديك أكثر من 20 شهادة

# CertificateNameLength
source: Certificate name must be between 2 and 200 characters
ar: يجب أن يكون اسم الشهادة بين 2 و 200 حرف

# IssuedByRequired
source: Issuing organization is required
ar: جهة الإصدار مطلوبة

# IssuedByLength
source: Issuing organization must be between 2 and 200 characters
ar: يجب أن تكون جهة الإصدار بين 2 و 200 حرف

# IssuedDateRequired
source: Issue date is required
ar: تاريخ الإصدار مطلوب

# IssuedDateInFuture
source: Issue date cannot be in the future
ar: لا يمكن أن يكون تاريخ الإصدار في المستقبل

# ExamResultMaxLength
source: Exam result cannot exceed 100 characters
ar: لا يمكن أن تتجاوز نتيجة الامتحان 100 حرف

# TooManySkills
source: Cannot have more than 50 skills
ar: لا يمكن أن تكون لديك أكثر من 50 مهارة

# TooManyTeachingAreas
source: Cannot have more than 20 teaching areas
ar: لا يمكن أن تكون لديك أكثر من 20 مجال تدريس

# TooManyAgeGroups
source: Cannot have more than 10 age groups
ar: لا يمكن أن تكون لديك أكثر من 10 فئات عمرية

# TooManyCommunicationMethods
source: Cannot have more than 10 communication methods
ar: لا يمكن أن تكون لديك أكثر من 10 طرق تواصل

# TooManyTeachingLanguages
source: Cannot have more than 10 teaching languages
ar: لا يمكن أن تكون لديك أكثر من 10 لغات تدريس

# DuplicateTeachingAreas
source: Duplicate teaching areas are not allowed
ar: مجالات التدريس المكررة غير مسموحة

# DuplicateAgeGroups
source: Duplicate age groups are not allowed
ar: الفئات العمرية المكررة غير مسموحة

# DuplicateCommunicationMethods
source: Duplicate communication methods are not allowed
ar: طرق التواصل المكررة غير مسموحة

# DuplicateTeachingLanguages
source: Duplicate teaching languages are not allowed
ar: لغات التدريس المكررة غير مسموحة

# DuplicateSkills
source: Duplicate skills are not allowed
ar: المهارات المكررة غير مسموحة

# AdminRegistrationSuccessful
source: Admin registered successfully
ar: تم تسجيل المدير بنجاح

source: Admin registration failed
ar: فشل تسجيل المدير
